_posts/2010-10-19-atom-feed.html
---
layout: post
title: Setting up an atom feed
categories:
- blogging
- atom
- jekyll
- RSS
---


<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">Setting up an RSS feed </h3>
<div class="outline-text-3" id="text-1">

<p>Once you've set up a blog, you might want to set up an RSS feed. And if you don't, well then, too bad! Setting up an RSS feed is quite simple with jekyll. First create a file called <code>atom.xml</code>.
</p><pre class="example">
&gt; touch atom.xml
</pre>


<p>
Next, just copy my <a href="http://github.com/alexhenning/alexhenning.github.com/blob/master/atom.xml"><code>atom.xml</code></a> into your <code>atom.xml</code>, changing username, email and the site to fit your site. It's a pretty plain file, mostly just saying that it's an atom feed
</p>



<pre class="src src-xml"><span id="coderef-begin-loop" class="coderef-off"><span class="linenr">1:  </span>{ % for post in site.posts limit:25 % }</span>
<span class="linenr">2:  </span>&lt;<span style="color: #edd400; font-weight: bold;">entry</span>&gt;
<span class="linenr">3:  </span>  &lt;<span style="color: #edd400; font-weight: bold;">title</span>&gt;{ { post.title } }&lt;/<span style="color: #edd400; font-weight: bold;">title</span>&gt;
<span class="linenr">4:  </span>  &lt;<span style="color: #edd400; font-weight: bold;">link</span> <span style="color: #ff6347;">href</span>=<span style="color: #ad7fa8; font-style: italic;">"http://alexhenning.github.com{ { post.url } }"</span>/&gt;
<span class="linenr">5:  </span>  &lt;<span style="color: #edd400; font-weight: bold;">updated</span>&gt;{ { post.date | date_to_xmlschema } }&lt;/<span style="color: #edd400; font-weight: bold;">updated</span>&gt;
<span class="linenr">6:  </span>  &lt;<span style="color: #edd400; font-weight: bold;">id</span>&gt;http://alexhenning.github.com{ { post.id }}&lt;/<span style="color: #edd400; font-weight: bold;">id</span>&gt;
<span class="linenr">7:  </span>  &lt;<span style="color: #edd400; font-weight: bold;">content</span> <span style="color: #ff6347;">type</span>=<span style="color: #ad7fa8; font-style: italic;">"html"</span>&gt;{ { post.content | xml_escape } }&lt;/<span style="color: #edd400; font-weight: bold;">content</span>&gt;
<span class="linenr">8:  </span>&lt;/<span style="color: #edd400; font-weight: bold;">entry</span>&gt;
<span id="coderef-end-loop" class="coderef-off"><span class="linenr">9:  </span>{ % endfor % }</span>
</pre>



<p>
However, this segment is pretty interesting, jekyll runs a loop that creates an atom &lt;entry&gt; for the last 25 posts posted. You can remove <code>limit:25</code> to show all posts ever, but that would become obnoxious after you got a large number of posts. Just pick a number that seems reasonable and go with it.
</p></div>
</div>
